/home/gw0/conll16st-v30/v34/tira_run_zh.sh /media/training-datasets/discourse-relation-sense-classification/conll16-st-dev-zh-2016-01-08 /tmp/gw0/2016-05-08-22-03-39/output



=== running on conn_eq_0 ===
./v34/classifier.py zh ./models-v34/conll16st-v3405-ceq0-zh-train /media/training-datasets/discourse-relation-sense-classification/conll16-st-dev-zh-2016-01-08 /tmp/gw0/2016-05-08-22-03-39/output --config={"filter_fn_name":"conn_eq_0", "arg1_len":500, "arg2_len":500, "words_dim":20, "focus_dim":4, "rnn_dim":20, "final_dim":100}
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 500)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 500)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            295700      arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 500, 4)      300         shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 10, 4)       300         shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 2, 4)        300         shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 500, 4)      300         shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 500, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 10, 20)      0           gru_11[0][0]                     
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 10, 20)      0           gru_11[0][0]                     
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 10, 20)      0           gru_11[0][0]                     
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 2, 20)       0           gru_16[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 2, 20)       0           gru_16[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 2, 20)       0           gru_16[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 2, 20)       0           gru_16[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 500, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 500, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 500, 20)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 500, 20)     0           gru_6[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 500, 20)     0           gru_6[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 500, 20)     0           gru_6[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 500, 20)     0           gru_6[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 10, 20)      0           gru_11[0][0]                     
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 500, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 2, 20)       0           shared_emb[3][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 500, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 500, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 500, 20)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 500, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 500, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 500, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 500, 20)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 10, 20)      0           shared_emb[2][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 20)          2460        merge_8[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 20)          2460        merge_9[0][0]                    
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 20)          2460        merge_10[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 20)          2460        merge_11[0][0]                   
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 20)          2460        merge_12[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 20)          2460        merge_13[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 20)          2460        merge_14[0][0]                   
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 20)          2460        merge_15[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 20)          2460        merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 20)          2460        merge_16[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 20)          2460        merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 20)          2460        merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 20)          2460        merge_4[0][0]                    
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 20)          2460        merge_5[0][0]                    
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 20)          2460        merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 20)          2460        merge_7[0][0]                    
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 320)         0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_7[0][0]                      
                                                                   gru_8[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_13[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_15[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_19[0][0]                     
                                                                   gru_20[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 100)         32100       merge_17[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 100)         400         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 100)         0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 12)          1212        dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 12)          0           dense_2[0][0]                    
====================================================================================================
Total params: 369972
____________________________________________________________________________________________________

=== running on conn_gt_0 ===
./v34/classifier.py zh ./models-v34/conll16st-v3405-909ecb89038db38e07865a4a565b75e9 /media/training-datasets/discourse-relation-sense-classification/conll16-st-dev-zh-2016-01-08 /tmp/gw0/2016-05-08-22-03-39/output --config={"filter_fn_name":"conn_gt_0", "arg1_len":500, "arg2_len":500, "words_dim":70, "focus_dim":5, "rnn_dim":30, "final_dim":90}
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
arg1_ids (InputLayer)              (None, 500)         0                                            
____________________________________________________________________________________________________
arg2_ids (InputLayer)              (None, 500)         0                                            
____________________________________________________________________________________________________
conn_ids (InputLayer)              (None, 10)          0                                            
____________________________________________________________________________________________________
punc_ids (InputLayer)              (None, 2)           0                                            
____________________________________________________________________________________________________
shared_emb (Embedding)             multiple            1034950     arg1_ids[0][0]                   
                                                                   arg2_ids[0][0]                   
                                                                   conn_ids[0][0]                   
                                                                   punc_ids[0][0]                   
____________________________________________________________________________________________________
gru_1 (GRU)                        (None, 500, 5)      1140        shared_emb[0][0]                 
____________________________________________________________________________________________________
gru_13 (GRU)                       (None, 10, 5)       1140        shared_emb[2][0]                 
____________________________________________________________________________________________________
gru_19 (GRU)                       (None, 2, 5)        1140        shared_emb[3][0]                 
____________________________________________________________________________________________________
gru_7 (GRU)                        (None, 500, 5)      1140        shared_emb[1][0]                 
____________________________________________________________________________________________________
timedistributed_1 (TimeDistributed)(None, 500, 70)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_10 (TimeDistributed(None, 500, 70)     0           gru_7[0][0]                      
____________________________________________________________________________________________________
timedistributed_11 (TimeDistributed(None, 10, 70)      0           gru_13[0][0]                     
____________________________________________________________________________________________________
timedistributed_12 (TimeDistributed(None, 10, 70)      0           gru_13[0][0]                     
____________________________________________________________________________________________________
timedistributed_13 (TimeDistributed(None, 10, 70)      0           gru_13[0][0]                     
____________________________________________________________________________________________________
timedistributed_14 (TimeDistributed(None, 10, 70)      0           gru_13[0][0]                     
____________________________________________________________________________________________________
timedistributed_15 (TimeDistributed(None, 10, 70)      0           gru_13[0][0]                     
____________________________________________________________________________________________________
timedistributed_16 (TimeDistributed(None, 2, 70)       0           gru_19[0][0]                     
____________________________________________________________________________________________________
timedistributed_17 (TimeDistributed(None, 2, 70)       0           gru_19[0][0]                     
____________________________________________________________________________________________________
timedistributed_18 (TimeDistributed(None, 2, 70)       0           gru_19[0][0]                     
____________________________________________________________________________________________________
timedistributed_19 (TimeDistributed(None, 2, 70)       0           gru_19[0][0]                     
____________________________________________________________________________________________________
timedistributed_2 (TimeDistributed)(None, 500, 70)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_20 (TimeDistributed(None, 2, 70)       0           gru_19[0][0]                     
____________________________________________________________________________________________________
timedistributed_3 (TimeDistributed)(None, 500, 70)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_4 (TimeDistributed)(None, 500, 70)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_5 (TimeDistributed)(None, 500, 70)     0           gru_1[0][0]                      
____________________________________________________________________________________________________
timedistributed_6 (TimeDistributed)(None, 500, 70)     0           gru_7[0][0]                      
____________________________________________________________________________________________________
timedistributed_7 (TimeDistributed)(None, 500, 70)     0           gru_7[0][0]                      
____________________________________________________________________________________________________
timedistributed_8 (TimeDistributed)(None, 500, 70)     0           gru_7[0][0]                      
____________________________________________________________________________________________________
timedistributed_9 (TimeDistributed)(None, 500, 70)     0           gru_7[0][0]                      
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 500, 70)     0           shared_emb[0][0]                 
                                                                   timedistributed_1[0][0]          
____________________________________________________________________________________________________
merge_10 (Merge)                   (None, 500, 70)     0           shared_emb[1][0]                 
                                                                   timedistributed_10[0][0]         
____________________________________________________________________________________________________
merge_11 (Merge)                   (None, 10, 70)      0           shared_emb[2][0]                 
                                                                   timedistributed_11[0][0]         
____________________________________________________________________________________________________
merge_12 (Merge)                   (None, 10, 70)      0           shared_emb[2][0]                 
                                                                   timedistributed_12[0][0]         
____________________________________________________________________________________________________
merge_13 (Merge)                   (None, 10, 70)      0           shared_emb[2][0]                 
                                                                   timedistributed_13[0][0]         
____________________________________________________________________________________________________
merge_14 (Merge)                   (None, 10, 70)      0           shared_emb[2][0]                 
                                                                   timedistributed_14[0][0]         
____________________________________________________________________________________________________
merge_15 (Merge)                   (None, 10, 70)      0           shared_emb[2][0]                 
                                                                   timedistributed_15[0][0]         
____________________________________________________________________________________________________
merge_16 (Merge)                   (None, 2, 70)       0           shared_emb[3][0]                 
                                                                   timedistributed_16[0][0]         
____________________________________________________________________________________________________
merge_17 (Merge)                   (None, 2, 70)       0           shared_emb[3][0]                 
                                                                   timedistributed_17[0][0]         
____________________________________________________________________________________________________
merge_18 (Merge)                   (None, 2, 70)       0           shared_emb[3][0]                 
                                                                   timedistributed_18[0][0]         
____________________________________________________________________________________________________
merge_19 (Merge)                   (None, 2, 70)       0           shared_emb[3][0]                 
                                                                   timedistributed_19[0][0]         
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 500, 70)     0           shared_emb[0][0]                 
                                                                   timedistributed_2[0][0]          
____________________________________________________________________________________________________
merge_20 (Merge)                   (None, 2, 70)       0           shared_emb[3][0]                 
                                                                   timedistributed_20[0][0]         
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 500, 70)     0           shared_emb[0][0]                 
                                                                   timedistributed_3[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 500, 70)     0           shared_emb[0][0]                 
                                                                   timedistributed_4[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 500, 70)     0           shared_emb[0][0]                 
                                                                   timedistributed_5[0][0]          
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 500, 70)     0           shared_emb[1][0]                 
                                                                   timedistributed_6[0][0]          
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 500, 70)     0           shared_emb[1][0]                 
                                                                   timedistributed_7[0][0]          
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 500, 70)     0           shared_emb[1][0]                 
                                                                   timedistributed_8[0][0]          
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 500, 70)     0           shared_emb[1][0]                 
                                                                   timedistributed_9[0][0]          
____________________________________________________________________________________________________
gru_10 (GRU)                       (None, 30)          9090        merge_8[0][0]                    
____________________________________________________________________________________________________
gru_11 (GRU)                       (None, 30)          9090        merge_9[0][0]                    
____________________________________________________________________________________________________
gru_12 (GRU)                       (None, 30)          9090        merge_10[0][0]                   
____________________________________________________________________________________________________
gru_14 (GRU)                       (None, 30)          9090        merge_11[0][0]                   
____________________________________________________________________________________________________
gru_15 (GRU)                       (None, 30)          9090        merge_12[0][0]                   
____________________________________________________________________________________________________
gru_16 (GRU)                       (None, 30)          9090        merge_13[0][0]                   
____________________________________________________________________________________________________
gru_17 (GRU)                       (None, 30)          9090        merge_14[0][0]                   
____________________________________________________________________________________________________
gru_18 (GRU)                       (None, 30)          9090        merge_15[0][0]                   
____________________________________________________________________________________________________
gru_2 (GRU)                        (None, 30)          9090        merge_1[0][0]                    
____________________________________________________________________________________________________
gru_20 (GRU)                       (None, 30)          9090        merge_16[0][0]                   
____________________________________________________________________________________________________
gru_21 (GRU)                       (None, 30)          9090        merge_17[0][0]                   
____________________________________________________________________________________________________
gru_22 (GRU)                       (None, 30)          9090        merge_18[0][0]                   
____________________________________________________________________________________________________
gru_23 (GRU)                       (None, 30)          9090        merge_19[0][0]                   
____________________________________________________________________________________________________
gru_24 (GRU)                       (None, 30)          9090        merge_20[0][0]                   
____________________________________________________________________________________________________
gru_3 (GRU)                        (None, 30)          9090        merge_2[0][0]                    
____________________________________________________________________________________________________
gru_4 (GRU)                        (None, 30)          9090        merge_3[0][0]                    
____________________________________________________________________________________________________
gru_5 (GRU)                        (None, 30)          9090        merge_4[0][0]                    
____________________________________________________________________________________________________
gru_6 (GRU)                        (None, 30)          9090        merge_5[0][0]                    
____________________________________________________________________________________________________
gru_8 (GRU)                        (None, 30)          9090        merge_6[0][0]                    
____________________________________________________________________________________________________
gru_9 (GRU)                        (None, 30)          9090        merge_7[0][0]                    
____________________________________________________________________________________________________
merge_21 (Merge)                   (None, 600)         0           gru_2[0][0]                      
                                                                   gru_3[0][0]                      
                                                                   gru_4[0][0]                      
                                                                   gru_5[0][0]                      
                                                                   gru_6[0][0]                      
                                                                   gru_8[0][0]                      
                                                                   gru_9[0][0]                      
                                                                   gru_10[0][0]                     
                                                                   gru_11[0][0]                     
                                                                   gru_12[0][0]                     
                                                                   gru_14[0][0]                     
                                                                   gru_15[0][0]                     
                                                                   gru_16[0][0]                     
                                                                   gru_17[0][0]                     
                                                                   gru_18[0][0]                     
                                                                   gru_20[0][0]                     
                                                                   gru_21[0][0]                     
                                                                   gru_22[0][0]                     
                                                                   gru_23[0][0]                     
                                                                   gru_24[0][0]                     
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 90)          54090       merge_21[0][0]                   
____________________________________________________________________________________________________
srelu_1 (SReLU)                    (None, 90)          360         dense_1[0][0]                    
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 90)          0           srelu_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 11)          1001        dropout_1[0][0]                  
____________________________________________________________________________________________________
rsenses (Activation)               (None, 11)          0           dense_2[0][0]                    
====================================================================================================
Total params: 1276761
____________________________________________________________________________________________________

Finished
